export const testHighlights = [
  {
    content: {
      text: '实验证明，由氧氯化锆锂和高镍三元正极组成的全固态锂电池展示了极为优异的性能：在12 分钟快速充电的条件下，该电池仍然成功地在室温稳定循环2000 圈以上。',
    },
    position: {
      boundingRect: {
        x1: 219.7,
        y1: 204.3,
        x2: 547.0,
        y2: 264.0,
        width: 849,
        height: 1200,
      },
      rects: [
        {
          x1: 219.7,
          y1: 204.3,
          x2: 547.0,
          y2: 264.0,
          width: 849,
          height: 1200,
        },
      ],
      pageNumber: 9,
    },
    comment: {
      text: 'Flow or TypeScript?',
      emoji: '🔥',
    },
    id: '8245652131754351',
  },
];
